// Напишите программу, которая на вход принимает число и выдаёт его квадрат

Console.WriteLine("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine());
int mult = number * number;
Console.WriteLine(mult);